import { IconType } from '../../components/Icon';

export interface IDisabilitiesCategory {
  id: number;
  name: string;
  title: string;
}

export interface IDisabilitiesSubCategory {
  id: number;
  categoryId: number;
  name: string;
  title: string;
  hide?: boolean;
}

export interface ISportCategory {
  id: number;
  categoryIds: number[];
  name: IconType;
  title: string;
  description?: string;
}

export const disabilitiesCategories: IDisabilitiesCategory[] = [
  {
    id: 1,
    name: 'amputatin',
    title: 'קטועים',
  },
  {
    id: 2,
    name: 'headInjured',
    title: 'ופגיעות ראש CP שיתוק מוחין',
  },
  {
    id: 3,
    name: 'spinalCord',
    title: 'פגיעות חוט שידרה',
  },
  {
    id: 4,
    name: 'blindness',
    title: 'עיוורון ולקות ראייה',
  },
  {
    id: 5,
    name: 'shortness',
    title: 'נמיכות קומה',
  },
];

export const disabilitiesSubCategoris: IDisabilitiesSubCategory[] = [
  {
    id: 1,
    categoryId: 1,
    name: 'oneLeg',
    title: 'רגל',
  },
  {
    id: 2,
    categoryId: 1,
    name: 'twoLegs',
    title: 'שתי רגליים',
  },
  {
    id: 3,
    categoryId: 1,
    name: 'oneHand',
    title: 'יד אחת',
  },
  {
    id: 4,
    categoryId: 1,
    name: 'twoHands',
    title: 'שתי ידיים',
  },
  {
    id: 5,
    categoryId: 1,
    name: 'handLeg',
    title: 'יד ורגל',
    hide: true,
  },
  {
    id: 6,
    categoryId: 1,
    name: 'twoHandsLeg',
    title: 'שתי ידיים ורגל',
    hide: true,
  },
  {
    id: 7,
    categoryId: 1,
    name: 'twoLegsHand',
    title: 'שתי רגליים ויד',
    hide: true,
  },
  {
    id: 8,
    categoryId: 1,
    name: 'twoLegsTwoHands',
    title: 'שתי רגליים ושתי ידיים',
    hide: true,
  },
  {
    id: 9,
    categoryId: 2,
    name: 'withWheelchair',
    title: 'עם כיסא גלגלים',
  },
  {
    id: 10,
    categoryId: 2,
    name: 'withoutWheelchair',
    title: 'בלי כיסא גלגלים',
  },
  {
    id: 11,
    categoryId: 3,
    name: 'parphalegs',
    title: 'פאראפלגים',
  },
  {
    id: 12,
    categoryId: 3,
    name: 'quadphalegs',
    title: 'קוואדריפלגים',
  },
  {
    id: 13,
    categoryId: 4,
    name: 'Blindness',
    title: 'עיוורון',
  },
  {
    id: 14,
    categoryId: 4,
    name: 'Semiblind',
    title: 'לקות ראייה',
  },
  {
    id: 15,
    categoryId: 5,
    name: 'Shortness',
    title: 'נמיכות קומה',
  },
];

export const SportCateories: ISportCategory[] = [
  {
    id: 1,
    categoryIds: [15],
    name: 'bikes',
    title: 'אופניים',
    description:
      'רכיבה על אופניים נכללה במשחקים הפראלימפיים החל משנת 1984. ענף זה יועד בהתחלה רק ללקויי ראיה שרכבו באופני זוגות יחד עם שותף ללא לקות ראיה. אופניים מסוג זה נקראים אופני טנדם. בהמשך, ענף רכיבת האופניים הותאם גם לבעלי לקויות פיזיות וכולל רכיבה על אופניים, תלת אופן ואופני יד. הספורטאי הפראלימפי קובי ליאון זכה במדליית הכסף באופני יד במשחקים הפראלימפים בלונדון 2012. ',
  },
  {
    id: 2,
    categoryIds: [],
    name: 'athletics',
    title: 'אתלטיקה',
    description:
      ' ענף האתלטיקה הוא אחד משמונת ענפי הספורט שהיו במשחקים הפראלימפים הראשונים ברומא 1960, ונחשב לענף הנצפה ביותר. הענף מתאים לכלל הליקויים ומחולק לתתי ענפים כגון אתלטיקה קלה (ריצות, קפיצות) ואתלטיקה כבדה (הדיפות, זריקות).',
  },
  {
    id: 3,
    categoryIds: [3, 4, 5, 6, 7, 8, 12, 13, 14],
    name: 'powerlifting',
    title: 'הרמת כוח',
    description:
      ' ענף הרמת כוח נכלל במשחקים הפראלימפיים החל משנת 1964, אותה תקופה רק גברים עם פגיעה בעמוד השדרה או שחלו בפוליו (מחלה המשתקת חלק מהגפיים) יכלו להשתתף. היום השתתפות מתאימה לשני המינים וגם לאנשים המוגבלים בפלג גופם התחתון. המטרה היא לבחון את כוח הידיים ופלג גופם העליון של הספורטאים. במהלך התחרות הספורטאי שוכב כאשר גפיו התחתונות קשורות ועליו לדחוק את המשקולות כלפי מעלה. לספורטאי יש שלושה ניסיונות ובכל ניסיון יש להעלות את המשקל. המנצח הוא זה שדחק את המשקל המקסימלי.',
  },
  {
    id: 4,
    categoryIds: [13, 14, 15],
    name: 'arrow',
    title: 'חץ וקשת',
    description:
      'חץ וקשת הוא הענף הראשון בו השתתפו ספורטאים בכיסאות גלגלים והוא אחד משמונת ענפי הספורט שהיו במשחקים הפראלימפים הראשונים בשנת 1960 ברומא. ענף זה בוחן דיוק, ריכוז וכוח. גודל ומרחק המטרה, ירי בעמידה או בישיבה ושימוש במתקני עזר משתנים על פי מידת המגבלה של המשתתפים. בתחרות יש 12 מקצים, כאשר כל מקצה אורך ארבע דקות ומוקצים עבורו שישה חצים, ובסך הכל יורים 72 חצים במשחק כולו. ',
  },
  {
    id: 5,
    categoryIds: [4, 6, 7, 8, 12, 15],
    name: 'rowing',
    title: 'חתירה',
    description:
      ' ענף זה נכלל במשחקים הפראלימפים לראשונה בשנת 2008. הספורטאים מתחרים למרחקים של מעל 1000 מטרים, על פני מים שטוחים בתוך סירות שמשתנות באורכן ובגודל ההרכב המתחרה. במשחקים האחרונים בריו 2016, מורן סמואל זכתה במדליית הארד בענף זה.',
  },
  {
    id: 6,
    categoryIds: [3, 4, 5, 6, 7, 8, 12, 13, 14, 15],
    name: 'tennis',
    title: 'טניס',
    description:
      " טניס כיסאות גלגלים הומצא בשנת 1976 על ידי בראד פארס שנפגע תאונת סקי והתנסה בטניס כאמצעי שיקום. בשנת 1977 בנה בארד כיסא מיוחד שמותאם למשחק והחל לקדם את הענף ובשנת 1992 נכנס ענף זה לראשונה למשחקים הפראלימפים. החוקים במשחק כמעט זהים לאלו של טניס שדה. בענף זה יש ייצוג מכובד והישגים רבים לספורטאים הישראליים כגון: מדליית זהב לנועם גרשוני במשחקים הפראלימפים בלונדון 2012, ומדליית כסף לזוגות בביג'ינג 2008, לבועז קרמר ושרגא ויינברג.",
  },
  {
    id: 7,
    categoryIds: [8, 9, 10, 13, 14],
    name: 'tabletennis',
    title: 'טניס שולחן',
    description:
      'אחד משמונת ענפי הספורט שהיו במשחקים הפראלימפיים הראשונים בשנת 1960 ברומא. גברים ונשים יכולים להשתתף בתחרויות ליחידים, זוגות וקבוצות. התחרות מורכבת מחמישה סטים של 11 נקודות (המשחק נקבע על פי הטוב מחמש). הספורטאים מחולקים לקלאסים שונים בישיבה ובעמידה. חוקי טניס שולחן אולימפי חלים על טניס שולחן פראלימפי למעט כמה התאמות קלות, למשל, אלו המשחקים בכיסא גלגלים חייבים לוודא שהכדור עובר את הקו האחורי בצד יריבם. ',
  },
  {
    id: 8,
    categoryIds: [4, 5, 6, 7, 8, 12, 13, 14, 15],
    name: 'triathlon',
    title: 'טריאתלון',
    description:
      'ענף זה נכלל במשחקים הפראלימפים לראשונה בשנת 2016. הספורטאים מתחרים בשלושה מקצועות - 750 מטר שחייה, לאחר מכן 20 קילומטר רכיבה על אופניים ולבסוף 5 קילומטר ריצה. כל ספורטאי יכול לבחור איזה אופניים מתאימים עבורו (טנדם, תלת אופן או אופני יד), ובחלק של הריצה ניתן להתחרות גם עם כיסא גלגלים. ',
  },
  {
    id: 9,
    categoryIds: [2, 3, 4, 7, 8, 9, 10, 13, 14, 15],
    name: 'volleyball',
    title: 'כדורעף',
    description:
      ' כדורעף ישיבה הוא ספורט קבוצתי שמציעות תנועה מתמדת ויכולת לתקשר. בספורט זה שתי קבוצות מתחרות זו בזו ובכל קבוצה יש שישה שחקים. מטרת המשחק היא שהכדור ייגע בקרקע המגרש של הקבוצה המתחרה. המשחק דומה לכדורעף עמידה עם מספר התאמות כמו, המגרשים יותר קטנים ורשת ההפרדה יותר נמוכה. במהלך כל המשחק אגן השחקנים צריך להיות מוצמד לקרקע.',
  },
  {
    id: 10,
    categoryIds: [3, 4, 6, 8, 13, 14, 15],
    name: 'basketball',
    title: 'כדורסל',
    description: `כדורסל כיסאות גלגלים הוא אחד משמונת ענפי הספורט שהיו במשחקים הפראלימפיים הראשונים בשנת 1960 ברומא וכיום הוא אחד מהענפים הפופולריים ביותר.
    פותח לראשונה על ידי חיילים פצועים בארצות הברית אחרי מלחמת העולם השנייה. מטרת המשחק היא לקלוע את מירב הנקודות לסל של הקבוצה היריבה. עבור ענף זה הותאמו כיסאות גלגלים מיוחדים שמשפרים את התנועה של הספורטאי במהלך המשחק. החוקים ברובם דומים לאלו של כדורסל רגיל, אחת ההתאמות היא שבמקום ספירת צעדים ללא כדרור נספרים מספר דחיפות חישוקי הגלגלים של השחקן ללא כדרור.`,
  },
  {
    id: 11,
    categoryIds: [3, 4, 8, 13, 14, 15],
    name: 'fencing',
    title: 'סייף',
    description:
      'סייף כיסאות גלגלים פותח על ידי סר לודוויג גוטמן בבית החולים סטוק מנדוויל והוצג בפני העולם במשחקים הפראלימפיים ברומא 1960. הספורט מתאים לנשים וגברים. כיסאות הגלגלים של הספורטאים מהודקים לרצפה במהלך בתחרות. ',
  },
  {
    id: 12,
    categoryIds: [6, 8, 13, 14, 15],
    name: 'shooting',
    title: 'קליעה',
    description:
      'ענף זה נכלל במשחקים הפראלימפים לראשונה ב1976. הספורטאי יורה לכיוון המטרה באקדח או רובה ובכך נבדקת מידת הדיוק, הריכוז והיציבות שלו. ספורטאים בענף זה משתמשים בריכוז ובנשימה מבוקרת כדי להפחית את קצב הלב ולשפר את היציבות והביצועים הגבוהים. דורון שזירי, הקלע הפראלימפי הישראלי השתתף בחמישה משחקים פראלימפים (החל באטלנטה 1996) בהם זכה ב 4 מדליות כסף ו- 4 מדליות ארד.',
  },
  {
    id: 13,
    categoryIds: [3, 4, 5, 6, 7, 8, 12, 13, 14, 15],
    name: 'kayak',
    title: 'קיאקים',
    description:
      ' ענף זה נכלל במשחקים הפראלימפים לראשונה בריו 2016. החוקים בענף זה זהים לאלו בענף האולימפי. החתירה בקאנו היא באמצעות משוט בעל כף אחת. חותרי הקיאק משתמשים במשוט בעל שתי כפות, בכל אחד מקצותיו. במשחקים נערכות תחרויות ספרינט וסלאלום.',
  },
  {
    id: 14,
    categoryIds: [],
    name: 'riding',
    title: 'רכיבה',
    description: `ענף רכיבה על סוסים נכלל במשחקים הפראלימפיים בפעם הראשונה בשנת 1996.
    הרכיבה מותאמת לבעלי לקויות פיזיות ולבעלי לקות ראייה. ספורטאים מתחרים בשלושה סוגי תחרות: דרסאז', מבחן של ביצוע תנועות קבועות ורכיבה חופשית לצלילי מוזיקה. יש גם תחרות קבוצתית בה משתתפים שלושה עד ארבעה רוכבים.
    `,
  },
  {
    id: 15,
    categoryIds: [],
    name: 'swimming',
    title: 'שחייה',
    description: `שחיה הוא אחד משמונת ענפי הספורט שהיו במשחקים הפראלימפיים הראשונים בשנת 1960 ברומא וכיום הוא אחד מהענפים הפופולריים ביותר.
    ענף השחייה מתאים לכל סוגי הליקויים. המתחרים מחולקים למקצים על פי מין ולפי רמת המוגבלות שלהם. שחיה מתאפשרת במגוון סגנונות, ביניהם סגנון חופשי, שחיית גב, שחיית פרפר, חזה וחתירה. לישראל יש מורשת ארוכה של הישגים רבים בענף זה. מבין השחיינים הפעילים בולטת ענבל פיזרו לה 9 מדליות פראלימפיות (4 כסף, 5 ארד).`,
  },
  {
    id: 16,
    categoryIds: [6, 7, 8],
    name: 'sailing',
    title: 'סקי אלפיני',
    description: `בסקי אלפיני, המשתתפים גולשים במורד ההר במסלול אשר מסומן עלי ידי צמדים של דגלים, כאשר, חייבים לעבור דרך הצמדים, מה שיוצר את הזגזוג בגלישה. במקרה שלא עוברים דרך אחד הצמדים, נפסלים. 
    הניצחון מוענק למשתתף שגלש בזמן הקצר ביותר. 
    בסקי האלפיני הפראלימפי ישנם 3 סוגים שונים של מסלולים, אשר נבדלים אחד מהשני בצפיפות צמדי הדגלים. ככל שהמרחק בין צמד לצמד קטן יותר, הגלישה דורשת מיומנות יותר טכנית, ככל שהמרחק גדול יותר הגלישה דורשת מיומנות של גלישה במהירות שיכולה להגיע אפילו ל 110 קמ"ש.
    המסלול הצפוף ביותר נקרא: 'סלאלום'. אחריו בדרגת הצפיפות 'סלאלום ענק', ו'סופר G'.`,
  },
  {
    id: 17,
    categoryIds: [1, 2, 3, 4, 5, 10, 11, 13, 14, 15],
    name: 'boccia',
    title: 'בוצ׳ה',
    description:
      ' משחק עתיק שהיה קיים עוד לפני הספירה ובשנות השבעים חודש על ידי מדינות סקנדינביה במטרה להתאימו לאוכלוסייה בעלת צרכים מיוחדים. נכלל לראשונה במשחקים הפראלימפיים בשנת 1984. את המשחק ניתן לשחק בקבוצות של עד 2-3 או כיחידים. לכל קבוצה יש כדורים בצבע אחר (אדום או כחול), הכדור הלבן נזרק בתחילת המשחק וקובע את המטרה. מטרת המשחק היא לגלגל את הכדור בעל הצבע קרוב ככול הניתן לכדור הלבן. מידת הקירבה בין כדורי הקבוצה לכדור הלבן מקנה לקבוצה נקודות והצד המנצח הוא זה עם מרבית הנקודות.',
  },
  {
    id: 18,
    categoryIds: [1, 2, 3, 4, 5, 6, 7, 9, 10, 11, 13, 14, 15],
    name: 'rugby',
    title: 'רוגבי',
    description:
      'מקורו של רוגבי כיסאות גלגלים הוא בקנדה והוא משלב אלמנטים שונים מרוגבי רגיל, כדורסל וכדוריד. ענף זה הפך לחלק מהמשחקים הפראלימפיים בפעם הראשונה בשנת 2000. רוגבי הוא ספורט קבוצתי שמתאים לנשים ולגברים. כיסאות הגלגלים שמתאימים לתחרות בספורט זה עוצבו במיוחד בשביל ענף זה. ',
  },
  {
    id: 19,
    categoryIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 15],
    name: 'judo',
    title: 'ג׳ודו',
    description: `נכלל במשחקים הפראלימפים בפעם הראשונה בשנת 1988 עבור גברים בלבד ובאתונה 2004 גם נשים החלו להתחרות. רק ספורטאים עם ליקוי ראייה רשאים להתחרות, כאשר כל אחד מהקלאסים (B1, B2 ו- B3) מתחרים זה בזה ומחולקים בהתאם לקטדוריות משקל. החוקים של הג'ודו הפראלימפי זהים לאלו של האולימפיים מלבד ההתאמה שהספורטאים רשאים לאחוז זה בזה במהלך התחרות. מטרת המשחק היא להרוויח יותר נקודות מהיריב על ידי מיומנויות התקפה או איפון (זריקת היריב עם הגב על הקרקע).`,
  },
  {
    id: 20,
    categoryIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 14, 15],
    name: 'soccer',
    title: 'כדורגל',
    description:
      'כדורגל עיוורים הוא עיבוד של ספורט הכדורגל שמותאם ללקויי ראיה ועיוורים. הענף השתתף לראשונה במשחקים הפראלימפיים בשנת 2004, ובכל תחרות ישנה מחלוקת האם הוא צריך להיכלל כענף במשחקים הפראלימפיים או לא. מדינת ברזיל זכתה במדליית זהב בכל התחרויות עד כה. במשחק משחקות שני קבוצות, בכל קבוצה יש ארבעה שחקנים עיוורים לחלוטין ושוער לקוי ראיה. כדי להבטיח תחרות הוגנת כל השחקנים מלבד השוער מחויבים ללבוש כיסוי עיניים. ',
  },
  {
    id: 21,
    categoryIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 15],
    name: 'goalball',
    title: 'כדור שער',
    description:
      ' הומצא באוסטריה בשנת 1946 כדי לסייע לנכי מלחמה שהתעוורו, לראשונה נכלל במשחקים הפראלימפים בשנת 1976. במשחק משחקות שתי קבוצות כשכל קבוצה מונה 3 שחקנים, בשני צידי המגרש יש שער ועל שחקני הקבוצה להבקיע לשער של הקבוצה היריבה על ידי זריקת הכדור. המשחק מתקיים באולם סגור ושקט - כדי שהשחקנים יוכלו לשמוע את הכדור המכיל פעמון. זריקת הכדור צריכה להתבצע תוך 10 שניות מהרגע שהכדור הגיע ליד השחקן. זהו ענף ייחודי המיועד לבעלי ליקויי ראייה ועיוורון וכל השחקנים משתמשים בכיסויי עיניים. בישראל יש קבוצות לנשים וגברים, לצעירים ובוגרים.',
  },
  {
    id: 22,
    categoryIds: [4, 6, 8, 13, 14],
    name: 'badminton',
    title: 'בדמינטון',
    description:
      ' התחרויות הבינלאומיות בבדמינטון פראלימפי החלו בשנת 1990, ענף זה יכלל לראשונה המשחקים הפראלימפים בטוקיו 2020. בדמינטון הוא ענף ספורט ממשפחת משחקי הכדור והמחבט, שבו ה"כדור" מורכב מבסיס ונוצות, ונקרא נוֹצִית. במשחק מתחרים שני יחידים או שני זוגות, שמטרתם היא לחבוט את הנוצית מעל הרשת כדי שתפגע ברצפת מגרשו של היריב, או שהוא לא יוכל להחזיר אותה בהצלחה. פרה בדמינטון משוחק בכיסא גלגלים או בעמידה.',
  },
  {
    id: 23,
    categoryIds: [1, 3, 4, 5, 6, 7, 8, 10, 13, 14, 15],
    name: 'dance',
    title: 'ריקודים',
    description: `ענף הריקודים בכיסא גלגלים החל בבריטניה בסוף שנות ה60. ענף חינני ומסוגנן המותאם לבעלי ליקויים פיזיים בפלג הגוף התחתון. הרקדנים יכולים להתחרות כיחידים, בזוגות עם בן זוג עומד, או בריקוד זוגי כששניהם רוקדים בכיסא גלגלים. סגנונות הריקוד כוללים בין היתר ואלס, טנגו, פוקסטרוט, סגנונות לאטיניים (סמבה, צ'ה צ'ה צ'ה, רומבה) וסגנונות חופשיים (בלט, בלט מודרני, היפ הופ ועוד). בשנת 1998 הוכר כענף כספורט פראלימפי תחרותי, אך עדיין לא נכלל במשחקים הפראלימפים.`,
  },
  {
    id: 24,
    categoryIds: [5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
    name: 'taekwondo',
    title: 'טקוואנדו',
    description:
      ' הוכר כענף ספורט פראלימפי בשנת 2015 ויכלל לראשונה במשחקים הפראלימפים בטוקיו 2020. טאיקוונדו היא אומנות לחימה קוריאנית שמתבססת בעיקר על כוח שנוצר כתוצאה מתנופה של מסת הגוף ומתנועת האגן ושמה דגש פחוּת על כוח ישיר. בנוסף יכולים להשתתף בענף זה קטועי ידיים מכיוון שהלחימה בענף זה מתבצעת בעיקר בעזרת פלג הגוף התחתון.',
  },
];
